{"meta":{"title":"GuoWei's blog","subtitle":"welcome to my gardon","description":"这是郭伟的小站，你可以在这儿发现软件评测，影评，语言教程等等丰富的资料。","author":"GuoWei","url":"https://freedgw.github.io","root":"/freedgw.github.io/"},"pages":[],"posts":[{"title":"油猴插件—脚本控制的瑞士军刀","slug":"油猴脚本","date":"2019-08-29T16:00:00.000Z","updated":"2019-08-30T04:37:29.969Z","comments":true,"path":"2019/08/30/油猴脚本/","link":"","permalink":"https://freedgw.github.io/2019/08/30/油猴脚本/","excerpt":"插件—脚本控制的瑞士军刀Tampermonkey是最受欢迎的用户脚本管理器，拥有超过1000万用户。 它适用于Chrome，Microsoft Edge，Safari，Opera Next和Firefox。Tampermonkey使您可以非常轻松地管理用户脚本，并提供诸如运行脚本的清晰概述，内置编辑器，基于ZIP的导入和导出，自动更新检查以及基于浏览器和云存储的同步等功能。","text":"插件—脚本控制的瑞士军刀Tampermonkey是最受欢迎的用户脚本管理器，拥有超过1000万用户。 它适用于Chrome，Microsoft Edge，Safari，Opera Next和Firefox。Tampermonkey使您可以非常轻松地管理用户脚本，并提供诸如运行脚本的清晰概述，内置编辑器，基于ZIP的导入和导出，自动更新检查以及基于浏览器和云存储的同步等功能。 油猴插件—脚本控制的瑞士军刀油猴是什么 Tampermonkey是最受欢迎的用户脚本管理器，拥有超过1000万用户。 它适用于Chrome，Microsoft Edge，Safari，Opera Next和Firefox。Tampermonkey使您可以非常轻松地管理用户脚本，并提供诸如运行脚本的清晰概述，内置编辑器，基于ZIP的导入和导出，自动更新检查以及基于浏览器和云存储的同步等功能。 这是来源于油猴官方网站的描述，简单的来说油猴就是一个脚本平台，通过这些脚本我们又可以修改网页内容和其他选项，为网页浏览带来了更多可能性。譬如包括去除百度广告，百度网盘直接下载，百度文库下载；解除特定网站复制限制等等多样的功能。 我在这里以教大家如何安装AC-baidu去除百度的搜索广告与优化搜索界面。AC-baidu就是一个油猴插件的脚本，它会让我们的搜索结果清爽许多。当然对于各网站的广告你可以选择大名鼎鼎的Adblock Plus来处理。 对于浏览器的选择，我只推荐Chrome和Firefox,理由有许多，之一便是与今天的主题有关的：它们两者有着丰富的插件配置选项，其他在此不赘述。 以Chrome浏览器为例，点击左上角的应用打开应用商店 首先要做的第一步是安装油猴插件，这一步的话大家可以直接进入chrome和firefox商店搜索油猴（Tampermonkey) 第一个即是我们的目标，点击Add to Chrome即可，等待下载安装完成。 油猴插件就是为用户脚本与浏览器内容架桥，而丰富的用户脚本则将大大提高我们浏览网页的体验。 用户脚本是一段代码，它们能够优化您的网页浏览体验。安装之后，有些脚本能为网站添加新的功能，有些能使网站的界面更加易用，有些则能隐藏网站上烦人的部分内容。 Firefox的安装同理，进入插件应用市场搜索安装即可。 同样的下载Adblock Plus也是在搜索栏搜索然后安装对应的插件就好。 对于使用Chrome浏览器但无法进入插件商店的，推荐一个同样可以下载大量插件的网站，最重要的是国内的网络环境可以直接访问。 Chrome插件下载 因为不是官方商店，所以在里面只能下载好插件再去Chrome插件管理中心配置安装，下面我为大家示范一下安装流程，因为Adblock Plus也可以找到。 进入该插件网站的界面： 可以看到有许多插件，搜索Tampermonkey和Adblock Plus 进入到了下载油猴插件的页面，点击download 这里我选择从crx4chrome下载.crx结尾的插件： 下载好之后，你需要知道你的浏览器下载目录，方便你之后找到文件，你可以在设置里查看保存位置，也可以在左下角下载好的文件右键打开文件位置了解存放目录。 然后我们需要解压插件文件，用解压软件解压即可，这里推荐两个免费好用的解压缩软件：Bandizip,Breezip 这里我用了Bandizip解压： 解压完成后的文件夹： 紧接着，你需要配置下载好的.crx结尾的Chrome插件，点击右上角的竖着排列的三个点，选择更多工具—&gt;扩展程序 进入后如下图所示： 打开右上角的开发者模式方便离线安装插件 然后点击左上角的加载已解压的扩展程序，找到刚才解压后的文件夹选择确定： 然后就成功安装插件了，Adblock Plus用同样的方法安装，这里直接给出这两个插件的下载地址： 油猴 Adblock Plus 这两个插件到此就安装完成了，到此，我已花了大量篇幅描述如何安装插件，因为chrome商店对于大多数人都是不可连接的。下面就是怎么安装治理百度的脚本-AC-baidu,该脚本同样可以调整谷歌，搜狗的界面： 给出脚本地址： AC-baidu 进入页面后如图，点击install this script: 在简介可看到该脚本的主要功能，我们来体验一下该脚本的作用。 首先是未安装该脚本时，搜索,octave是一款类似matlab数学绘图软件 可以看到右侧页面的相关术语和搜索热点占据了大部分空间，使用AC-baidu后： 可以看到右侧的多余信息被去除了，整体页面居中占据视线中央，如果你并不喜欢这种布局你可以在右上方的自定义工具菜单里进行调整： 选择双列可以看到更多搜索结果分布在页面： 同样也可以设置谷歌，必应，搜狗的搜索结果界面。 想要查看更多脚本吗，没问题，在右上侧你可以发现安装好的油猴插件图标： 就是这个黑色圆角图标，中间仿佛两个眼睛对吧！ 左键单击，选择获取新脚本，你在这里也可以方便的开启或关闭安装的脚本 进入到下面的界面： 下面给出了几个规模较大的脚本网站，只推荐第一个和第三个，第二个风险较大且脚本已不再维护。 两个站点地址： GreasyFork openuserjs 进入GreasyFork首页： 英文界面可在右上角中文选项中切换到中文，从搜索栏下面的关键词就可看出该脚本网站的很多脚本都是针对国内平台的，而第二个openuserjs则更偏重于国外平台。 安装提示点击下方的scripts for:baidu.com,搜索结果中就出现了许多与百度有关的脚本，大家可根据自己的需要安装。 选取质量好的脚本主要看下载量与最近更新日期。下面我推荐几款自用的脚本： pandownload网页版 之前我在百度网盘提速指南里已经提到过pandownload这款非常好用的下载工具，今天它已经推出了网页版，可以直接下载小于4G的文件，这款插件的作用就是将一个有效的百度网盘连接直接跳转到pandownload网页版，带来良好的下载体验。效果如下： 直接下载助手 这个跟上一个插件部分功能是重复的，因为pandownload网页版将下载大小设置在4G，对于更大的文件就需要直链脚本了（必须先登录百度账号才可以使用） 使用效果如下： 百度文库免费下载（对于要使用下载券的文档十分实用，下方两个都可以） 使用过程： 如图，可看到三个箭头所指，原文档时=是需要两个下载券才能下载的，装了百度文库下载脚本后在左上角箭头处出现一个下载按钮，在文件名称下方出现下载vvv，这是两个脚本，都可以下载到文档。 到此，关于油猴插件的安装与脚本的推荐我已详细介绍，当然其商店里还有更多优秀的脚本，脚本的管理在管理面板里，可以删除和关闭安装的脚本。 感谢阅读，如有更多想了解的内容可在后台私信回复。","categories":[{"name":"Chrome","slug":"Chrome","permalink":"https://freedgw.github.io/categories/Chrome/"}],"tags":[{"name":"插件","slug":"插件","permalink":"https://freedgw.github.io/tags/插件/"},{"name":"工具","slug":"工具","permalink":"https://freedgw.github.io/tags/工具/"}]},{"title":"厚墨-予阅读以深度","slug":"厚墨-予阅读以深度","date":"2019-08-19T16:00:00.000Z","updated":"2019-08-20T05:07:00.965Z","comments":true,"path":"2019/08/20/厚墨-予阅读以深度/","link":"","permalink":"https://freedgw.github.io/2019/08/20/厚墨-予阅读以深度/","excerpt":"厚墨，是安卓平台上的一款阅读APP，其秉持了高度简洁的设计风格。从界面设计上它已超越了一众布局冗杂的app,而更强大的，则是它完全免费的让你享受到无广告的出版书阅读体验。","text":"厚墨，是安卓平台上的一款阅读APP，其秉持了高度简洁的设计风格。从界面设计上它已超越了一众布局冗杂的app,而更强大的，则是它完全免费的让你享受到无广告的出版书阅读体验。 厚墨-予阅读以深度厚墨，是安卓平台上的一款阅读APP，其秉持了高度简洁的设计风格。从界面设计上它已超越了一众布局冗杂的app,而更强大的，则是它完全免费的让你享受到无广告的出版书阅读体验。当然它也包括了网络小说的书源，但你可以完全将这些元素剔除在外。 界面书架 我们选择加入书架的书籍会显示在这个界面，方面阅读。 发现 此界面的操作占据软件使用的绝大部分，我将为大家一个一个详细说明。 本机文件首先是本机文件，厚墨支持以下三种格式文件 epub mobi azw3 这三种文件格式基本上是在kindle体验最为良好的书籍格式，选择本机文件后厚墨会直接在你的手机里搜索这三种格式的文件，你可以将搜索的相应文件加入到书架方便阅读。 WIFI传书进入该选项后，厚墨会给出一串传输地址，在电脑浏览器中输入该地址，可以向厚墨直接传输支持的格式文件（需要连接WIFI)： 书源厚墨的灵魂功能，所谓书源，即网友通过正则表达式等规则包装和改造小说网站界面，制作成成可直接导入厚墨里的格式，厚墨在识别到书源后会自动利用这些规则来显示这些书籍，从而带来纯净的阅读体验。 具体的操作流程可见下方gif： 因为我已经导入过书源，所以可看到我的书源商店里面的书源信息，新用户需要进入书源仓库里输入暗码获得制作好的书源： 我的书源： 可看到 开启与关闭按钮，长按直接删除 在这里如果你只想阅读出版类书籍的话，可按照书源左下角的提示出版类条目选择安装并开启 右上角加号进入书源商店，可管理所有书源，包括安装与卸载： 点击右上角设置，进入书源仓库，在这里输入暗码对接已有的仓库，现有的5个暗码： 1212，2000，2333，9713，9251 输入框部分有提示，输入对应数字就可 搜索接下来介绍的就是搜索功能，在这里你可以直接搜索书名或者作者，稍微等待一下就可以看到搜索结果。如下所示： 搜索书籍名：《追忆似水年华》，《奥德赛》 加入书架后面方便后面阅读。 搜索作者名：贾平凹 可以看到找到了贾平凹的代表作品，当书源较少时搜索速度很快。 排行排行界面其实可以看作书籍的浏览界面，在这里你可以直观地看到详细的分类，适合发现你所未熟悉的内容领域，书源涉及领域广泛，包括了东西方经典名著，期刊杂志，中医古籍等等中多方面的内容，你甚至可以在这上面读近期的《读者》，《意林》，里面的插图也能正常显示，阅读体验颇佳，甚有梦回高中之意。 RSS订阅资讯类信息，选你所想，除了本身提供适配的一些站点外，你也可以直接订阅你感兴趣的频道的rss地址： 设置如果你想摒弃rss带来的咨询对你的干扰，只想纯粹的阅读，那么你可以在设置里关闭这一选项 接下来我们要看一下厚墨的阅读体验，我们打开书架的一本书： 沉浸式的状态栏，中央轻点呼出目录，上划可看到完整目录；排版选项可调整字号与行距间距。 主题选项可以选择阅读背景，模板不多，夜间模式足够实用，选择右上角的加号可以进行更进一步的定制，包括背景的rgb色值,也可以直接选择纯色系的图片作为背景。 如果想要离线阅读直接点击下方的缓存按钮即可。 阅读设置里可以设置翻页方式及其它页面选项： 到此，关于厚墨的基本功能我已经作出详细的说明，这些已经足够满足大多人的使用，如果你想拥有同步功能或者云端空间及其它服务，你可以选择付费订阅高级功能支持作者。 我们可以选择微信读书，网易蜗牛阅读等来在闲暇时间阅读，但它们往往有时间的限制和冗余的服务，那么何不尝试这一款厚墨作为你的新选择呢？它没有任何广告，且书源的高度可定制化意味着你也可以学习制作属于你自己的书源，对epub,mobi,azw3的良好支持也是它的优势之一，诚然它在阅读上还没做到标注，笔记，翻译的丰富功能，但阅读有时候所需的不就是一种简单的纯粹的环境吗？关于电子书与实体书的争论从未中断过，但电子书的便携性确实改变了我们的阅读方式，仪式感的阅读究竟是不是一个伪命题呢，我们选择愈多干扰愈多，所以，配置你的独一无二的厚墨并让它与你为伴吧。 下载地址： https://www.coolapk.com/apk/cn.deepink.reader","categories":[{"name":"安卓软件","slug":"安卓软件","permalink":"https://freedgw.github.io/categories/安卓软件/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"https://freedgw.github.io/tags/阅读/"},{"name":"APP","slug":"APP","permalink":"https://freedgw.github.io/tags/APP/"}]},{"title":"探记—记录你的生活轨迹","slug":"探记—记录你的生活轨迹","date":"2019-08-19T16:00:00.000Z","updated":"2019-08-20T05:07:06.815Z","comments":true,"path":"2019/08/20/探记—记录你的生活轨迹/","link":"","permalink":"https://freedgw.github.io/2019/08/20/探记—记录你的生活轨迹/","excerpt":"探记是一款专注于个人记录的软件。它将帮助你做到：写日记，记笔记，生活开支记账，待办提醒，生活目标打卡，习惯养成，倒数纪念日，照片，走路步数等等","text":"探记是一款专注于个人记录的软件。它将帮助你做到：写日记，记笔记，生活开支记账，待办提醒，生活目标打卡，习惯养成，倒数纪念日，照片，走路步数等等 探记—记录你的生活轨迹探记是什么探记是一款专注于个人记录的软件。它将帮助你做到：写日记，记笔记，生活开支记账，待办提醒，生活目标打卡，习惯养成，倒数纪念日，照片，走路步数等等，开发者还在不断加入更多的实用功能以使它变得更加完善，在做到这些丰富功能的同时它也保持了简洁清新不冗杂的交互界面。以下由我带你探索探记现阶段的使用，如果它正是你需要的，那么你将得到一个亲密的生活助手而不必去为了这些功能在应用商店筛选那些条目众多的应用。 进入软件时素雅的过渡界面： 背景中的词云显示了探记已拥有的或计划中开发的功能，可以发现其囊括了我们日常生活中会经常使用的大部分需要。 进入软件直接通过手机号注册账号，在这里可以选择同微信，QQ以及微博相关联，以后登陆账号的时候可直接通过第三方软件授权登录。 可在安全设置里打开数字密码，设置完成数字密码后可同时开启指纹解锁，兼顾安全与快速。 点击软件下侧状态栏中央的加号，可选择创建多种任务： 需要说明的时，后期还会加入例如生理期记录和课程表等更多实用的功能。所以，让我们一起期待探记变得更强大多能吧！ 小记可以记录200字以内的灵感想法，短暂的灵光一闪或以备遗忘的消息可以记录在这里。 来看看最终的效果图吧： 长文长文选项里允许我们输入更多的文字，且包括了封面和标题的设置，你可以在这里创作你自己的故事。只是现在功能还相对简陋，希望后面可以支持更加丰富的背景或格式选项。 成果实例： 链接收藏一些有用的网站，这个对我真的是特别有用，平常在搜集资料的时候会浏览大量网页才能找到有效内容，而寄存这些内容的网站往往都是一个个特别实用的资源宝藏，这时我喜欢将它们分门别类收集起来以供之后的需要： 所以这就像一个脱离了网页的书签收藏夹，将那些发现的宝藏网址都存在这里吧！在这里网址可以直接点击进入，如果只是做简单的查看的话就不用再复制到浏览器中。在上面你也看到添加标签的选项，在这里我选择了新建书签将这些网页分类到特定的项目中去，这将大大提高我们的搜索效率。 照片照片这一栏可以将自己的照片上传，上传的过程可以选择默认压缩或者原图，这时候探记就成为你的云端相册了。 记账系统上方的菜单图标提供了细分的消费类别，我们可以清晰地选择类别记录自己的花销情况。 右侧选择收入可以记录自己相应的收入情况： 在备注里你可以详细的说明收入或消费的具体情况。 图表化展示你的账单： 待办清单选择你的待办事项，在下侧选择具体的开始时间与结束时间，同时点击箭头可设置待办事项的优先级： 最终效果： 对于待办事项，你可以在右上角的日历里直接添加，同时也可以看到你所设置的待办事项在四象限中的分布。 目标习惯用户可自定义习惯目标选项，也可方便的从提供的模板里选择日常习惯中譬如早睡，喝水等之类直接应用选择循环天数与具体时间: 在这里的目标关联可以将其他选项联系起来，形成记录的一个简短关系链条。 日子日子里，你可以选择一些重要的日期以使你铭记，很重要的你可以选择记录同学的生日，或者考试或其他重要的日期，倒计时是一个很实用的功能。 身体数据记录你的身高，体重情况，更多的你也可以记录头围，腰围等身体数据，它将帮助你记忆减肥历程中身体的各项数据变化情况，同时该软件也给出了你的运动状况。 以上是该APP现阶段所拥有的功能展示，在探记主页，动态如你的专属朋友圈一样展示出了你各种类型的数据记录，你可以以信息流的方式回顾你的一天，一周，一月~ 我们每天都在经历新鲜的环境与事物：看见天空中变幻的云彩，听见雨水撞击池塘，嗅见大雨过后草木的清香。我们也在不断地错过与遗忘，如果我脚色匆匆，什么都顾不得，什么都没记录下，我不知道我所经历的过去的含义，那我会失去我么？ 我们需要记录自己的印迹，无论是以怎样的形式，这样我们在这个世界才不会时时茫然无所适从。走远方，探索着，记录着，我们都是自己的见证者。 期待你与探记的邂逅。","categories":[{"name":"安卓软件","slug":"安卓软件","permalink":"https://freedgw.github.io/categories/安卓软件/"}],"tags":[{"name":"APP","slug":"APP","permalink":"https://freedgw.github.io/tags/APP/"},{"name":"习惯","slug":"习惯","permalink":"https://freedgw.github.io/tags/习惯/"}]},{"title":"网址导航","slug":"网址导航","date":"2019-08-19T16:00:00.000Z","updated":"2019-08-23T14:08:36.644Z","comments":true,"path":"2019/08/20/网址导航/","link":"","permalink":"https://freedgw.github.io/2019/08/20/网址导航/","excerpt":"个人常用网站整理，方便快速访问","text":"个人常用网站整理，方便快速访问 网址导航Fortran在线编译，调试","categories":[{"name":"网页整理","slug":"网页整理","permalink":"https://freedgw.github.io/categories/网页整理/"}],"tags":[{"name":"网页","slug":"网页","permalink":"https://freedgw.github.io/tags/网页/"},{"name":"效率","slug":"效率","permalink":"https://freedgw.github.io/tags/效率/"}]}]}